#include<stdio.h>

//int a[5]={1,2,3,4,5};
int a[5][5]={
{0,1,1,1,1},
{1,0,0,0,0},
{1,0,0,0,1},
{1,0,0,0,1},
{1,0,1,1,0}};
int b[5]={0};//表示是否已经走过了，未走过为1，走过为0. 
int stack[5]={0};
void f(int i,int l)
{
	b[i]=1;//把位置占好，表示已经不考虑了 
	//对当前行，遍历每列，看是否有某一列有值，如果有值，说明该列对应的点可以访问 
	for(int j=0;j<5;j++)
	{
		if(j==i) continue;
		if(a[i][j]==1&&b[j]==0)
		{
			//把当前点对应的路封了 ，避免其他点走到这里回环 
			b[j]=1;
			stack[l]=i;
			f(j,l+1);
			//解封路 
			b[j]=0;
		}
	}
	stack[l++]=i;//把当前数放入缓冲中 
	for(int k=0;k<l;k++)
	{
		printf("%d,",stack[k]+1); 
	}
	printf("\n");
	b[i]=0;//让出位置 
}
int main()
{
	
	f(1,0);
}
